Revit 2027 API
ScheduleDefinition.AddSortGroupField Method
 Adds a new sorting/grouping field at the end of the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSortGroupField(
	ScheduleSortGroupField sortGroupField
)
Public Sub AddSortGroupField (
	sortGroupField As ScheduleSortGroupField
)
public:
void AddSortGroupField(
	ScheduleSortGroupField^ sortGroupField
)
member AddSortGroupField :
        sortGroupField : ScheduleSortGroupField -> unit
Parameters
sortGroupField ScheduleSortGroupField
 The sorting/grouping field to add.
Exceptions
Exception | Condition
ArgumentException |  The field ID is not the ID of a field in this ScheduleDefinition. -or- The field cannot be used for sorting/grouping.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The resulting sorting/grouping field count would be greater than 4.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace